{
// 1. ორი რიცხვის ჯამი
	int a = 10;
	int b = 20;
	int c = 30;
	
	int SumOfTwo = a + b;
}
// 2. სამი რიცხვის ჯამი
	int a = 10;
	int b = 20;
	int c = 30;

	int SumOfThree = a + b + c; 
}

{
// 3. მოცემულია რიცხვი. ავღწეროთ 3 ცვლადი. პირველს მივანიჭოთ მოცემული რიცხვი,
//მეორეს ცვლადს მივანიჭოთ 3-ით მეტი ვიდრე პირველ ცვლადს, მესამე ცვლადში მოვათავსოთ 1-ლი და მე-2 ცვლადის ჯამი.
	int Num = 5;
	int FirstNum;
	int SecondNum;
	int Res;

        FirstNum = Num;
        SecondNum = FirstNum + 3;
        Res = FirstNum + SecondNum;
}


{
// 4. მოცემულია მთელი რიცხვი a. გამოვაცხადოთ ცვლადი sum და მოვათავსოთ მასში მოცემული a რიცხვის შემდეგი და წინა რიცხვების ჯამი.	
	int a = 7;
	int Sum;

	Sum = (a - 1) + (a + 1);
}


{
// 5. მოცემულია 2 ცვლადი. გავუცვალოთ ადგილები. (არ გამოვიყენოთ დამატებითი ცვლადი)
	int x = 10;
	int y = 20;

	x = x + y;
	y = x - y;
	x = x - y;
}

{
// 6. ვიპოვოთ მარკუთხედის ფართობი. მოცემულია 2 მთელი დადებითი რიცხვი a და b. ავღწეროთ ცვლადი სახელად area და მივანიჭოთ მართკუთხედის ფართობი.
	int a = 4;
	int b = 5;
	int Area;

	Area = a * b;
}

{
// 7. პირობა იგივეა რაც მეორე ამოცანაში ოღონდ ვიპოვოთ პერიმეტრი
	int a = 4;
	int b = 5;
	int Perimeter;

	Perimeter = 2 * (a + b);
}

{
// 8. ფუნთუშა ღირს a ლარი და b თეთრი. გამოთვალეთ რამდენი თეთრი არის გადასახდელი n რაოდენობის ფუნთუშაში. 
//პროგრამაში მოცემულია სამი მთელი რიცხვი: a, b, n შესაბამისად დავთვალოთ რამდენი თეთრი უნდა გადავიხადოთ.

	int a = 1;
	int b = 50;
	int n = 10;
	int Total;

	Total = (a * 100 + b) * n;
}


{
// 9. N მოსწავლე იყოფს K ვაშლს თანაბრად. მორჩენილი ვაშლები რჩება ისევ კალათაში. რამდენი ვაშლი შეხვდება თითოეულ მოსწავლეს?
	int n = 5;
	int k = 15;
	int Result;

	Result = k / n;
}

{	
// 10. N მოსწავლე იყოფს K ვაშლს თანაბრად. მორჩენილი ვაშლები რჩება ისევ კალათაში. რამდენი ვაშლი დარჩება კალათაში?
	int n = 3;
	int k = 14;
	int Result;

	Result = k % n;
}


{
//  11. მოცემულია რიცხვი. ავღწეროთ ცვლადი result. თუ მოცემული რიცხვი ლუწია აღწერილი ცვლადში ჩავწეროთ 0 თუ არა და 1
	int num = 7;
	int result;

	if(num % 2 == 0)
	{
	    result = 0;
	}
	else
	{
	    result = 1;
	}
}

{
// 12. მოცემულია მთელი რიცხვი n. result ცვლადში მოვათავსოთ მოცემული რიცხვის შემდეგ მდგომი ლუწი რიცხვი
	int n = 200;
	int result;

	if(n % 2 == 0)
	{
	    result = n + 2;
	}
	else
	{
	    result = n + 1;
	}
      
}
